In [6]:
#LEARNING GOALS 
  #LOAD & EXTRACT ZIP FILES INTO A DATAFRAME
  #PERFORM EXPLORATORY DATA ANALYSIS
  #CREATE VISUALIZATIONS USING PYTHON
  #MANIPULATE PANDAS FOR ANALYSIS  

# 1. Import files into a dataframe
# 2. Create univariate plots of variables: rating, age, release date, gender, occupation
# 3. Visualize how the popularity of genres have changed over the years.  From the graph, we
    #should be able to see (for any given year) movies of which genre got released the most
# 4. Display the top 25 movies by average rating, as listed in a dataframe.  Only consider 
     #movies with at least 100 ratings

#5.  Verify the following: 
                        #Men watch more drama than women...
                        #Men watch more romance than women
                        #Women watch more scifi than men 
            

#1 import packages that we will use to create the plots
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns


#INSTRUCTOR USED THESE LINES ALSO

%matplotlib inline                 
#what is this?????
import warnings                    #
#import pandas_profiling           # what's in this package?
#from scipy.stats import*          #what's the purpose of this package???    
warnings.filterwarnings('ignore')  #what does this do??

In [7]:
#2 open datasets into dataframes so that we can analyze the data
data=pd.read_csv('Data.csv')
item=pd.read_csv('item.csv')
user=pd.read_csv('user.csv')
                                    #GOOD JOB!!!

In [ ]:
#3 apply info, shape, describe and find the number of missing values

#INSTEAD OF USING THREE SEPARATE WINDOWS, WE CAN PULL AND DESCRIBE EACH DATAFRAME IN ITS OWN WINDOW

#data
print(data.head())
print()
print(data.info())
print()
print(data.shape)
print()
print(data.describe())
print()
print(data.isnull().sum())

In [ ]:

#item
print(item.head())
print()
print(item.info())
print()
print(item.shape)
print()
print(item.describe())
print()
print(item.isnull().sum())

In [ ]:
#user
user.head()

In [ ]:


user.info

In [9]:
user.shape

(943, 5)

In [10]:
user.describe()

          user id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

In [11]:
user.isnull().sum()

user id       0
age           0
gender        0
occupation    0
zip code      0
dtype: int64

In [12]:
#4 Find the number of movies per genre

item.columns #gives us the names of all columns in the dataframe

Index(['movie id', 'movie title', 'release date', 'unknown', 'Action',
       'Adventure', 'Animation', 'Childrens', 'Comedy', 'Crime', 'Documentary',
       'Drama', 'Fantasy', 'Film-Noir', 'Horror', 'Musical', 'Mystery',
       'Romance', 'Sci-Fi', 'Thriller', 'War', 'Western'],
      dtype='object')

In [13]:

#how I did it

item.sum()

movie id                                                  1415136
movie title     Toy Story GoldenEye Four Rooms Get Shorty Copy...
release date    01-Jan-199501-Jan-199501-Jan-199501-Jan-199501...
unknown                                                         1
Action                                                        251
Adventure                                                     135
Animation                                                      42
Childrens                                                     122
Comedy                                                        505
Crime                                                         109
Documentary                                                    50
Drama                                                         725
Fantasy                                                        22
Film-Noir                                                      24
Horror                                                         92
Musical                                                        56
Mystery                                                        61
Romance                                                       247
Sci-Fi                                                        101
Thriller                                                      251
War                                                            71
Western                                                        27
dtype: object

In [14]:
#how professor found sum of each column.  Specified the exact columns for the sum
item[['unknown', 'Action',
       'Adventure', 'Animation', 'Childrens', 'Comedy', 'Crime', 'Documentary',
       'Drama', 'Fantasy', 'Film-Noir', 'Horror', 'Musical', 'Mystery',
       'Romance', 'Sci-Fi', 'Thriller', 'War', 'Western']].sum()  #we just sum up the column

unknown          1
Action         251
Adventure      135
Animation       42
Childrens      122
Comedy         505
Crime          109
Documentary     50
Drama          725
Fantasy         22
Film-Noir       24
Horror          92
Musical         56
Mystery         61
Romance        247
Sci-Fi         101
Thriller       251
War             71
Western         27
dtype: int64

In [43]:
item.loc[:,'Action':'Western'].sum()#sum each column by using the location function

Action         251
Adventure      135
Animation       42
Childrens      122
Comedy         505
Crime          109
Documentary     50
Drama          725
Fantasy         22
Film-Noir       24
Horror          92
Musical         56
Mystery         61
Romance        247
Sci-Fi         101
Thriller       251
War             71
Western         27
dtype: int64

In [44]:
item.iloc[:,3:22].sum() #sum columns using item location method

unknown          1
Action         251
Adventure      135
Animation       42
Childrens      122
Comedy         505
Crime          109
Documentary     50
Drama          725
Fantasy         22
Film-Noir       24
Horror          92
Musical         56
Mystery         61
Romance        247
Sci-Fi         101
Thriller       251
War             71
Western         27
dtype: int64

In [33]:
item[['unknown','Action']].corr()  #we can run correlations on columns

          unknown    Action
unknown  1.000000 -0.010221
Action  -0.010221  1.000000

In [77]:
#5  Find the number of movies that have more than 1 

#I presented the total of the column.  Prof wants a descriptive detail with names

GenreCount=item[item == 1].sum(axis=1) #counts each row's genre counts. Where each column value=1, it totals the row 
Number_of_Multiple_Genre_Movies=(GenreCount>1).sum() #selects each movie with a count>1
print(Number_of_Multiple_Genre_Movies)

849

In [57]:
#alternative way to display the movies that have more than 1 genre

NewItem=item[['movie id','movie title']]

In [82]:
NewItem["Number of Genres"] =item[item == 1].sum(axis=1) #adds a new column to the NewItem with "movie id" and "movie title"
#new column contains a genre count

      movie id                          movie title  Number of Genres
0            1                           Toy Story                4.0
1            2                           GoldenEye                3.0
2            3                          Four Rooms                1.0
3            4                          Get Shorty                3.0
4            5                             Copycat                3.0
...        ...                                  ...               ...
1676      1678                          Mat' i syn                1.0
1677      1679                           B. Monkey                2.0
1678      1680                       Sliding Doors                2.0
1679      1681                        You So Crazy                1.0
1680      1682  Scream of Stone (Schrei aus Stein)                1.0

[1678 rows x 3 columns]

In [84]:
NewItem[NewItem['Number of Genres']>1] #selects all movies with more than 1 genre

      movie id         movie title  Number of Genres
0            1          Toy Story                4.0
1            2          GoldenEye                3.0
3            4         Get Shorty                3.0
4            5            Copycat                3.0
6            7     Twelve Monkeys                2.0
...        ...                 ...               ...
1667      1669  MURDER and murder                3.0
1668      1670            Tainted                2.0
1671      1673             Mirage                2.0
1677      1679          B. Monkey                2.0
1678      1680      Sliding Doors                2.0

[849 rows x 3 columns]

In [80]:
#6 Drop the item where the genre is unknown
item[item.unknown == 1] #identify movies with unknown genre code
item=item.drop(item.index[1371]) #drops the movie line that we located

In [49]:
#alternative by Prof uses
item=item[item['unknown']!=1] #how do we use this exclamation point??? what is it for?

In [ ]:
sns.distplot(user.)

In [182]:
data.head()

   user id  movie id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596

In [217]:
data.shape

(100000, 4)

In [184]:
print(data)

       user id  movie id  rating  timestamp
0          196       242       3  881250949
1          186       302       3  891717742
2           22       377       1  878887116
3          244        51       2  880606923
4          166       346       1  886397596
...        ...       ...     ...        ...
99995      880       476       3  880175444
99996      716       204       5  879795543
99997      276      1090       1  874795795
99998       13       225       2  882399156
99999       12       203       3  879959583

[100000 rows x 4 columns]

In [238]:
data5=data.groupby('movie id').rating.mean()
data5.head()

movie id
1    3.878319
2    3.206107
3    3.033333
4    3.550239
5    3.302326
Name: rating, dtype: float64

In [188]:
data1.head()

          user id  rating  timestamp
movie id
1             452     452        452
2             131     131        131
3              90      90         90
4             209     209        209
5              86      86         86

In [189]:
print(data1)

          user id  rating  timestamp
movie id
1             452     452        452
2             131     131        131
3              90      90         90
4             209     209        209
5              86      86         86
...           ...     ...        ...
1678            1       1          1
1679            1       1          1
1680            1       1          1
1681            1       1          1
1682            1       1          1

[1682 rows x 3 columns]

In [211]:
data1.sort_values('rating', ascending=False)

          user id  rating  timestamp
movie id
50            583     583        583
258           509     509        509
100           508     508        508
181           507     507        507
294           485     485        485
...           ...     ...        ...
1576            1       1          1
1577            1       1          1
1348            1       1          1
1579            1       1          1
1682            1       1          1

[1682 rows x 3 columns]

In [213]:
NewDF=pd.merge(item,data1,on='movie id')

In [215]:
NewDF.head

(1681, 23)

In [221]:
NewDF=pd.merge(item,data1,on='movie id') #merge table

In [ ]:
NEW=groupby('movie id').rating.mean()

In [236]:
OVER100=NewDF[NewDF.rating>99]
OVER100.shape
print(OVER100)

      movie id        movie title release date  unknown  Action  Adventure  \
0            1         Toy Story   01-Jan-1995        0       0          0
1            2         GoldenEye   01-Jan-1995        0       1          1
3            4        Get Shorty   01-Jan-1995        0       1          0
6            7    Twelve Monkeys   01-Jan-1995        0       0          0
7            8              Babe   01-Jan-1995        0       0          0
...        ...                ...          ...      ...     ...        ...
926        928        Craft, The   26-Apr-1996        0       0          0
1010      1012     Private Parts   07-Mar-1997        0       0          0
1014      1016           Con Air   06-Jun-1997        0       1          1
1026      1028  Grumpier Old Men   01-Jan-1995        0       0          0
1045      1047      Multiplicity   12-Jul-1996        0       0          0

      Animation  Childrens  Comedy  Crime  ...  Musical  Mystery  Romance  \
0             1          1       1      0  ...        0        0        0
1             0          0       0      0  ...        0        0        0
3             0          0       1      0  ...        0        0        0
6             0          0       0      0  ...        0        0        0
7             0          1       1      0  ...        0        0        0
...         ...        ...     ...    ...  ...      ...      ...      ...
926           0          0       0      0  ...        0        0        0
1010          0          0       1      0  ...        0        0        0
1014          0          0       0      0  ...        0        0        0
1026          0          0       1      0  ...        0        0        1
1045          0          0       1      0  ...        0        0        0

      Sci-Fi  Thriller  War  Western  user id  rating  timestamp
0          0         0    0        0      452     452        452
1          0         1    0        0      131     131        131
3          0         0    0        0      209     209        209
6          1         0    0        0      392     392        392
7          0         0    0        0      219     219        219
...      ...       ...  ...      ...      ...     ...        ...
926        0         0    0        0      104     104        104
1010       0         0    0        0      100     100        100
1014       0         1    0        0      137     137        137
1026       0         0    0        0      148     148        148
1045       0         0    0        0      134     134        134

[338 rows x 25 columns]